x = [-23, -16, -12.5, -10.3, -8.5, -7.4, -1.8, 0.5, 5.5, 7.2, 13.4, 17.3, 21.4, 24.7, 26.4, 26.6, 30.2, 31.7, 37.7, 42.1];
y = [12.79, 7.03, 3.3, 0.64, -0.1, -2.63, -7.18, -11.98, -13.62, -14.59, -23.83, -23.37, -30.91, -33.13, -35.37, -34.75, -40.22, -39.38, -45.52, -52.32];

t = linspace(-30, 50, 200);
f = -0.9836948225681024*t - 9.164291120451267;

figure('Units', 'pixels', 'Position', [100 100 800 600]);
hold on;
grid on;
xlabel('x');
ylabel('y');
plot(x, y, 'x', 'MarkerSize', 4);
plot(t, f, 'k-', 'LineWidth', 1.5);  % без DisplayName

set(gca, 'GridLineStyle', ':', 'GridAlpha', 0.55);

print('../../images/approx.png', '-dpng', '-r300');
hold off;

